---
kind: property
id: P:Autodesk.Revit.DB.Lighting.InitialFluxIntensity.Flux
source: html/0e6b5f32-3ec5-6abc-7879-54a8101eabac.htm
---
# Autodesk.Revit.DB.Lighting.InitialFluxIntensity.Flux Property

The flux intensity value.

## Syntax (C#)
```csharp
public double Flux { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The flux intensity value is not valid because it is not between 0 and 1e+30.